Repository: 5818959/drupal_tfa_basic
Catalog: translations/tfa_basic-7.x-1.1.*.po
Languages: ru

source: Two-factor authentication (TFA) provides additional security for your account. With TFA enabled, you log in to the site with a verification code in addition to your username and password.
ru: Двухфакторная аутентификация (TFA) обеспечивает дополнительную безопасность для Вашей учетной записи. При включенной TFA Вы входите на сайт с кодом подтверждения в дополнение к своим логину и паролю.

source: Status: <strong>TFA enabled</strong>, set !time. <a href="!url">Disable TFA</a>
ru: Статус: <strong>TFA включена</strong> !time. <a href="!url">Отключить TFA</a>

source: Status: <strong>TFA disabled</strong>, set !time.
ru: Статус: <strong>TFA выключена</strong> !time.

source: TFA application
ru: TFA приложение

source: Generate verification codes from a mobile or desktop application.
ru: Создание кодов подтверждения с мобильного или настольного приложения.

source: Set up application
ru: Настройка приложения

source: Reset application
ru: Сброс приложения

source: Receive verification code via SMS.
ru: Получите код подтверждения с помощью SMS.

source: Deliver to @number
ru: Доставить на @number

source: Set up SMS delivery
ru: Настройка доставки SMS

source: Reset SMS delivery
ru: Сброс доставки SMS

source: Not available for use
ru: Недоступно для использования

source: Receive verification code via your account's email address (@email_address).
ru: Получить код подтверждения через адрес электронной почты своей учетной записи (@email_address).

source: Set up email delivery
ru: Настройка доставки по электронной почте

source: Reset email delivery
ru: Сброс доставки по электронной почте

source: @browser, expires !expiration
ru: @browser, истекает !expiration

source: @browser, expires !expiration, last used !time
ru: @browser, истекает !expiration, последнее использование !time

source: Trusted browsers
ru: Доверенные браузеры

source: Browsers that will not require a verification code during login.
ru: Браузеры, которые не будут запрашивать код подтверждения во время входа.

source: Set trusted browsers
ru: Настройка доверенных браузеров

source: Recovery codes
ru: Коды восстановления

source: Pre-generated, one-time-use codes intended as a fallback should other methods be unavailable.
ru: Предварительно генерируемые одноразовые коды, предназначенные для резервного копирования, должны быть недоступны другими методами.

source: Get recovery codes
ru: Получить коды восстановления

source: View unused recovery codes
ru: Посмотреть неиспользуемые коды восстановления

source: Get new recovery codes
ru: Получить новые коды восстановления

source: Are you sure you want to disable TFA on account %name?
ru: Вы действительно хотите отключить TFA для учетной записи %name?

source: TFA settings and data will be lost. %name can re-enable TFA again from their profile.
ru: Настройки и данные TFA будут потеряны. %name сможет снова включить TFA из своего профиля.

source: This account is required to have TFA enabled per the 'require TFA' permission on one of their roles. Disabling TFA will remove their ability to log back into the site. If you continue, consider also removing the role so they can authenticate and setup TFA again.
ru: Эта учётная запись требует включенной TFA разрешением 'требуется TFA' в одной из своих ролей. Отключение TFA удалит возможность входа на сайт. Если Вы продолжите, рассмотрите также удаление роли, чтобы пользователи могли аутентифицировать и настроить TFA еще раз.

source: Are you sure you want to disable your two-factor authentication setup?
ru: Вы действительно хотите отключить двухфакторную аутентификацию?

source: Your settings and data will be lost. You can re-enable two-factor authentication again from your profile.
ru: Ваши настройки и данные будут потеряны. Вы можете снова включить двухфакторную аутентификацию из своего профиля.

source: Your account must have at least one two-factor authentication method enabled. Continuing will disable your ability to log back into this site.
ru: У Вашей учетной записи должен быть включен хотя бы один метод двухфакторный аутентификации. Продолжив Вы потеряете возможность входить на этот сайт.

source: Your settings and data will be lost and you will be unable to log back into the site. To regain access contact a site administrator.
ru: Ваши настройки и данные будут потеряны, и Вы не сможете вернуться на сайт. Чтобы восстановить доступ, обратитесь к администратору сайта.

source: Confirm your current password
ru: Подтвердите свой текущий пароль

source: Disable
ru: Отключить

source: Cancel
ru: Отмена

source: Incorrect password.
ru: Неверный пароль.

source: TFA disable canceled.
ru: Отключение TFA отменено.

source: TFA has been disabled.
ru: TFA отключен.

source: Enter your current password to alter TFA settings for account %name.
ru: Введите текущий пароль, чтобы изменить настройки TFA для учетной записи %name.

source: Enter your current password to continue.
ru: Введите текущий пароль, чтобы продолжить.

source: Current password
ru: Текущий пароль

source: Confirm
ru: Подтвердить

source: TFA setup - Application
ru: Настройка TFA - Приложение

source: Note: You should delete the old account in your mobile or desktop app before adding this new one.
ru: Примечание. Перед добавлением новой учетной записи Вы должны удалить старую учетную запись в своем мобильном или настольном приложении.

source: TFA setup - Trusted browsers
ru: Настройка TFA - Доверенные браузеры

source: TFA setup - Recovery codes
ru: Настройка TFA - Коды восстановления

source: TFA setup - SMS
ru: Настройка TFA - SMS

source: Mobile phone number
ru: Номер мобильного телефона

source: Enter your mobile phone number that can receive SMS codes. A code will be sent to this number for validation.
ru: Введите номер своего мобильного телефона, который может получать коды SMS. Код будет отправлен на этот номер для проверки.

source: This number is stored on your account under field %label.
ru: Этот номер хранится в вашей учетной записи в поле %label.

source: Send SMS
ru: Отправить SMS

source: Disable SMS delivery
ru: Отключить доставку SMS

source: A code was sent to @number. It may take up to a minute for its arrival.
ru: Код был отправлен на @number. Доставка может занять до минуты.

source: If the code does not arrive or you entered the wrong number skip this step to continue without SMS delivery. You can enable it after completing the rest of TFA setup.
ru: Если код не пришел или Вы ввели неправильный номер, пропустите этот шаг, чтобы продолжить без доставки SMS. Вы можете включить его после завершения остальной настройки TFA.

source: If the code does not arrive or you entered the wrong number click here to start over.
ru: Если код не пришел или Вы ввели неправильный номер, нажмите здесь, чтобы начать заново.

source: TFA setup - Email
ru: Настройка TFA - Email

source: Return to account TFA overview
ru: Вернуться к профилю TFA

source: Skip
ru: Пропустить

source: Skip and finish
ru: Пропустить и закончить

source: TFA setup canceled.
ru: Настройка TFA отменена.

source: TFA SMS delivery disabled.
ru: Доставка SMS-сообщений TFA отключена.

source: There was an error during TFA setup. Your settings have not been saved.
ru: При настройке TFA произошла ошибка. Ваши настройки не сохранены.

source: TFA setup complete.
ru: Настройка TFA завершена.

source: Application codes not enabled.
ru: Коды приложений не включены.

source: Application code verified.
ru: Код приложения подтвержден.

source: SMS code delivery not enabled.
ru: Доставка кода по SMS не включена.

source: SMS code verified.
ru: Код СМС подтвержден.

source: Email code delivery not enabled.
ru: Доставка кода по электронной почте не включена.

source: Email code verified.
ru: Код электронной почты подтвержден.

source: Browser not saved.
ru: Браузер не сохранен.

source: Browser saved.
ru: Браузер сохранен.

source: Recovery codes not saved.
ru: Коды восстановления не сохранены.

source: Saved recovery codes.
ru: Сохраненные коды восстановления.

source: TFA disabled for user @name UID !uid
ru: TFA отключен для пользователя @name UID !uid

source: TFA SMS disabled for user @name UID !uid
ru: TFA по SMS отключен для пользователя @name UID !uid

source: TFA enabled for user @name UID !uid
ru: TFA включен для пользователя @name UID !uid

source: One setup step remaining.
ru: Остался один шаг настройки.

source: Set up TFA for account
ru: Настройка TFA для учетной записи

source: Allow users to set up TFA for their account. Users with "administer users" permission can edit other account's TFA.
ru: Разрешить пользователям настраивать TFA для своей учетной записи. Пользователи с правами «администрировать пользователей» могут редактировать TFA другого аккаунта.

source: Login disallowed. You are required to set up two-factor authentication. Please contact a site administrator.
ru: Вход запрещен. Вам необходимо настроить двухфакторную аутентификацию. Обратитесь к администратору сайта.

source: If you are having trouble click "Can't access your account?" for further authentication options.
ru: Если у Вас возникли проблемы, нажмите «Не удается получить доступ к своей учетной записи?» для дополнительных способов входа.

source: Number does not match expected patterns.
ru: Число не соответствует ожидаемым шаблонам.

source: The phone number must only contain digits, space, hyphen or plus.
ru: Номер телефона должен содержать только цифры, пробел, дефис или плюс.

source: Roles required to have set up TFA
ru: Роли, необходимые для настройки TFA

source: Login will be denied to an account without TFA setup and any matching role.
ru: Вход будет отклонен для учетной записи без настройки TFA и любой соответствующей роли.

source: Cookie domain
ru: Cookie домен

source: Domain to set for the trusted browser TFA cookie.
ru: Домен для настройки TFA cookie доверенного браузера.

source: Twilio account SID
ru: SID аккаунта Twilio

source: Twilio account SID from twilio.com.
ru: SID аккаунта Twilio с twilio.com.

source: Twilio account token
ru: Токен аккаунта Twilio

source: Private Twilio account token from twilio.com.
ru: Приватный токен аккаунта Twilio с twilio.com.

source: Twilio account number
ru: Номер аккаунта Twilio

source: Private Twilio account number from twilio.com.
ru: Приватный номер аккаунта Twilio с twilio.com.

source: Twilio message text
ru: Текст сообщения Twilio

source: Text to be sent to the user. Use !code for the verification code.
ru: Текст для отправки пользователю. Используйте !code для кода подтверждения.

source: Validate phone numbers against NANP
ru: Проверять номер телефона на соответствие NANP

source: If enabled phone numbers will be checked against the North American Numbering Plan.
ru: Если включено, номера телефонов будут проверены в соответствии с Североамериканским планом нумерации.

source: SMS mobile number
ru: SMS мобильный номер

source: <div class="error messages">An account field for mobile number storage is required to use the Twilio SMS plugin. Consult TFA Basic README.txt for more info.</div>
ru: <div class="error messages">Для использования плагина Twilio SMS требуется поле учетной записи для хранения мобильных номеров. Для получения дополнительной информации обратитесь к TFA Basic README.txt.</div>

source: Account field that stores mobile numbers.
ru: Поле учетной записи, в котором хранятся номера мобильных телефонов.

source: Not available for use because Twilio PHP library is not installed. See TFA Basic README.txt.
ru: Недоступно для использования, потому что библиотека Twilio PHP не установлена. См. TFA Basic README.txt.

source: Email subject text
ru: Текст темы письма электронной почты

source: The email subject sent to user.
ru: Тема письма электронной почты, отправляемого пользователю.

source: Email message text
ru: Текст сообщения электронной почты

source: The email message sent to user.
ru: Сообщение письма электронной почты, отправляемое пользователю.

source: Contact support to reset your access
ru: Обратитесь в службу поддержки, чтобы сбросить доступ

source: Help page text
ru: Текст страницы справки

source: Text to display on help page. Plain text only.
ru: Текст для отображения на странице справки. Только обычный текст.

source: Cookie domain is required if Trusted Browser plugin is enabled.
ru: Домен cookie требуется, если включен плагин Доверенные браузеры.

source: Account SID is required if Twilio SMS plugin is enabled.
ru: SID учетной записи требуется, если включен плагин Twilio SMS.

source: Account token is required if Twilio SMS plugin is enabled.
ru: Токен аккаунта требуется, если включен плагин Twilio SMS.

source: Account number is required if Twilio SMS plugin is enabled.
ru: Номер аккаунта требуется, если включен плагин Twilio SMS.

source: Message text is required if Twilio SMS plugin is enabled.
ru: Текст сообщения требуется, если включен плагин Twilio SMS.

source: Message text must include token !code.
ru: Текст сообщения должен содержать код !code.

source: An account field for mobile number storage is required to use the Twilio SMS plugin. Consult TFA Basic README.txt for more info.
ru: Для использования плагина Twilio SMS требуется поле учетной записи для хранения мобильных номеров. Для получения дополнительной информации обратитесь к TFA Basic README.txt.

source: Email subject required if Email plugin is enabled.
ru: Тема электронной почты требуется, если включен плагин электронной почты.

source: Email message required if Email plugin is enabled.
ru: Сообщение электронной почты требуется, если включен плагин электронной почты.

source: Your @site_name account now has two-factor authentication
ru: Для Вашей учетной записи @site_name активирована двухфакторная аутентификация

source: Your @site_name account no longer has two-factor authentication
ru: У Вашей учетной записи @site_name больше нет двухфакторной аутентификации

source: [user:name], Thanks for configuring two-factor authentication on your @site_name account! This additional level of security will help to ensure that only you are able to log in to your account. If you ever lose the device you configured, you should act quickly to delete its association with this account. -- @site_name team
ru: [user:name], Благодарим за настройку двухфакторной аутентификации в Вашей учетной записи @site_name! Этот дополнительный уровень безопасности поможет гарантировать, что только Вы сможете войти в свою учетную запись. -- @site_name

source: [user:name], Two-factor authentication has been disabled on your account. If you did not take this action, please contact a site administrator immediately. -- @site_name team
ru: [user:name], В Вашем аккаунте отключена двухфакторная аутентификация. Если не Вы производили это действие, немедленно свяжитесь с администратором сайта. -- @site_name

source: Removed !num TFA trusted browsers older than !time
ru: Удалены !num TFA доверенных браузера старше !time

source: Security
ru: Безопасность

source: TFA disable
ru: Отключить TFA

source: TFA setup
ru: Настройка TFA - SMS

source: TFA - Unused recovery codes
ru: TFA - Неиспользованные коды восстановления

source: TFA Basic Plugins
ru: TFA Базовые плагины

source: TFA plugins for Time-based One Time Passwords, Trusted Browsers, Recovery Codes, and Twilio SMS
ru: Плагины TFA для одноразовых паролей, доверенных браузеров, кодов восстановления и Twilio SMS

source: Verification Code
ru: Код подтверждения

source: Enter @length-character code sent to your email account (@email).
ru: Введите @length-значный код, отправленный на Ваш адрес электронной почты (@email).

source: Verify
ru: Проверить

source: Resend
ru: Отправить повторно

source: Invalid code.
ru: Неверный код.

source: An error occured while attempting to email your authentication code. If you continue to experience difficulties, please contact us.
ru: Произошла ошибка при попытке отправить код по электронной почте. Если Вы продолжаете испытывать трудности, свяжитесь с нами.

source: Unable to send e-mail. Contact the site administrator if the problem persists.
ru: Невозможно отправить e-mail. Свяжитесь с администратором сайта, если проблема повторяется.

source: Code resent
ru: Код отправлен повторно

source: Unable to deliver code to that email address.
ru: Не удалось доставить код на этот адрес электронной почты.

source: Enter @length-character code sent to your email account (@email_address).
ru: Введите @length-значный код, отправленный на Ваш адрес электронной почты (@email_address).

source: Verify and save
ru: Проверить и сохранить

source: Invalid code. Please try again.
ru: Неверный код. Пожалуйста, попробуйте еще раз.

source: Enter one of your recovery codes
ru: Введите один из кодов восстановления

source: Recovery codes were generated when you first set up TFA. Format: XXX XX XXX
ru: Коды восстановления были созданы при первой настройке TFA. Формат: XXX XX XXX

source: You have no unused codes available.
ru: У вас нет неиспользованных кодов.

source: Invalid recovery code.
ru: Неверный код восстановления.

source: Your recovery codes
ru: Ваши коды восстановления

source: Print, save, or write down these codes for use in case you are without your application and need to log in.
ru: Распечатайте, сохраните или запишите эти коды для использования в случае, если Вы не используете приложение, и Вам необходимо войти в систему.

source: Save
ru: Сохранить

source: Used TFA recovery code !id by user !uid
ru: Используйте TFA код восстановления !id пользователя !uid

source: Unable to deliver the code. Please contact support.
ru: Не удалось доставить код. Обратитесь в службу поддержки.

source: Enter @length-character code sent to your device.
ru: Введите @length-символьный код, отправленный на ваше устройство.

source: Unable to deliver code to that number.
ru: Не удалось доставить код на этот номер.

source: Message !id sent to user !uid on @sent
ru: Сообщение !id отправлено пользователю !uid на @sent

source: Twilio send message error to user !uid. Status code: @code, message: @message, link: @link
ru: Twilio отправил сообщение об ошибке пользователя !uid. Код статуса: @code, сообщение: @message, ссылка: @link

source: Application verification code
ru: Код подтверждения приложения

source: Verification code is application generated and !length digits long.
ru: !length-символьный код проверки сгенерирован приложением.

source: Invalid application code. Please try again.
ru: Недопустимый код приложения. Пожалуйста, попробуйте еще раз.

source: Invalid code, it was recently used for a login. Please wait for the application to generate a new code.
ru: Недействительный код, он был недавно использован для входа. Подождите, пока приложение создаст новый код.

source: Install authentication code application on your mobile or desktop device:
ru: Установите приложение для проверки подлинности на мобильном или настольном устройстве:

source: <p>The two-factor authentication application will be used during this setup and for generating codes during regular authentication. If the application supports it, scan the QR code below to get the setup code otherwise you can manually enter the text code.</p>
ru: <p>Приложение для двухфакторной аутентификации будет использоваться во время этой установки и для генерации кодов во время обычной проверки подлинности. Если приложение поддерживает это, сканируйте QR-код ниже, чтобы получить код установки, иначе Вы можете вручную ввести текстовый код.</p>

source: Enter this code into your two-factor authentication app or scan the QR code below.
ru: Введите этот код в свое приложение двухфакторной аутентификации для проверки подлинности или сканируйте QR-код ниже.

source: A verification code will be generated after you scan the above QR code or manually enter the setup code. The verification code is six digits long.
ru: Код подтверждения будет сгенерирован после сканирования вышеуказанного QR-кода или вручную введите установочный код. Код подтверждения составляет шесть цифр.

source: Remember this browser for @interval?
ru: Запомнить этот браузер на @interval?

source: Not recommended if you are on a public or shared computer.
ru: Не рекомендуется, если Вы используете общедоступный компьютер.

source: Trusted browsers are a method for simplifying login by avoiding verification code entry for a set amount of time, !time days from marking a browser as trusted. After !time days, to log in you'll need to enter a verification code with your username and password during which you can again mark the browser as trusted.
ru: Доверенные браузеры - это метод упрощения входа в систему, избегая ввода кода подтверждения в течение установленного количества времени, !time дней с момента определения браузера как надежного. Через !time дней, чтобы войти в систему, Вам нужно ввести код подтверждения с Вашим именем пользователя и паролем, в течение которого Вы можете снова пометить браузер как надежный.

source: Trust this browser?
ru: Доверять этому браузеру?

source: Name this browser
ru: Назовите этот браузер

source: Optionally, name the browser on your browser (e.g. "home firefox" or "office desktop windows"). Your current browser user agent is %browser
ru: При желании укажите название для браузер (например, «домашний firefox» или «office desktop windows»). Текущее имя Вашего браузера - %browser

source: Existing browsers
ru: Существующие браузеры

source: Leave checked to keep these browsers in your trusted log in list.
ru: Оставьте отмеченным, чтобы сохранить эти браузеры в списке надежного входа в систему.

source: @name (current browser)
ru: @name (текущий браузер)

source: Expires !expiration
ru: Истекает !expiration

source: Expires !expiration, last used for log in !time
ru: Истекает !expiration, последний раз использовался для входа !time

source: Set trusted browser for user UID !uid, browser @name
ru: Установить доверенный браузер для пользователя UID !uid, браузер @name

source: Removed !num TFA trusted browsers during trusted browser setup
ru: Удалено !num TFA доверенных браузера в процессе настройки доверенных браузеров
